HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/cabin/DtH2O
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      DtH2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    ".*"
    {
        type            calculated;
        value           uniform 0.001;
    }
    cabin_to_windshield
    {
        type            calculated;
        value           uniform 0.001;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.001;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.001;
    }
    symmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
