HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/cabin/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/cabin";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue           table
        (
            (0   273)
            (60  273)
            (61  308)
            (100 308)
        );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            zeroGradient;
    }
    cabin_to_windshield
    {
        type            humidityTemperatureCoupledMixed;
        kappaMethod     fluidThermo;
        kappa           none;

        // Mode of operation: inert, condensation, vaporization,
        // condensationAndEvaporation
        mode            condensationAndEvaporation;
        specie          H2O;
        carrierMolWeight  28.9 ;//Air from materialProperties
        L               0.1;
        Tvap            273;    //Minimum temperature for evaporation

        liquid
        {
            H2O
            {
                defaultCoeffs       yes;
            }
        }

        value           $internalField;
    }
}


// ************************************************************************* //
