HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/cabin/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/cabin";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue           table
        (
            (0   (0 0 0))
            (60  (0 0 0))
            (61  (-2 0 0))
            (100 (-2 0 0))
        );
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cabin_to_windshield
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
