HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/cabin/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

YH2O
{
    type            concentrationTransport;
    active          true;
    hookOp          solve;
    fieldName       H2O;
    noDiffusionBoundaries ( );
}

airDeflection
{
    type            directionalPressureGradientExplicitSource;
    active          true;

    directionalPressureGradientExplicitSourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        c1Zone;

        fields      (U);
        flowDir     (1 2 0);        // flow direction
        relaxationFactor    0.3;

        faceZone    f1Zone;

        //Pressure drop model [Pa]
        model       DarcyForchheimer;//volumetricFlowRateTable/constant

        //DarcyForchheimer
        D           5e7;
        I           0;
        length      0.01;

        //constant
        //pressureDrop    8;

        //volumetricFlowRateTable
        //outOfBounds     clamp;
        //file            "volFlowRateTable";
    }
}

// ************************************************************************* //
