HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/cabin/topoSetDictRegister
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f1;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box     (-0.126 0.08665  0.2565) (0.02 0.090665 0.446);
        }
    }

     {
        name    f1Zone;
        type    faceZoneSet;
        action  new;
        source  setAndNormalToFaceZone;
        sourceInfo
        {
            faceSet     f1;
            normal  (0 1 0);
        }
    }

    {
        name    c1;
        type    cellZoneSet;
        action  new;
        source  faceToCell;
        sourceInfo
        {
            set     f1Zone;
            option  neighbour;
        }
    }

    {
        name    c1Zone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c1;
        }
    }
);


// ************************************************************************* //
