HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "solverControls"

libs            ("libliquidPropertiesFvPatchFields.so");

application     chtMultiRegionFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         90;

deltaT          0.01;

writeControl    adjustableRunTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxDi           10e3;

functions
{
    fileUpdate
    {
        type                timeActivatedFileUpdate;
        libs                ("libutilityFunctionObjects.so");
        writeControl        timeStep;
        writeInterval       1;
        region              cabin;
        fileToUpdate        "$FOAM_CASE/system/solverControls";

        timeVsFile
        (
            ( 1     "$FOAM_CASE/system/solverControls.0" )
            ( 5     "$FOAM_CASE/system/solverControls.5")
            ( 20    "$FOAM_CASE/system/solverControls.20")
            ( 60    "$FOAM_CASE/system/solverControls.60")
        );
    }
}


// ************************************************************************* //
