HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/solverControls.60
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/

writeInterval   2.5;

maxCo           12;

maxDeltaT       1;

#inputMode           merge

// ************************************************************************* //
