HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // make the mesh a little more interesting...
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (-100 -100 -100) (100 0.1 0.25);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box     (-100 -100 0.45) (100 0.1 100);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box     (-100 0.05 0.33) (100 0.1 0.38);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  invert;
    }
);


// ************************************************************************* //
